import { createContext, useContext, useState } from "react";

const AldaataiUgContext = createContext();

const AldaataiUgProvider = ({ children }) => {
  let asuultData = [
    {
      question:
        "Даваагынх гол дагаж нүүсээр хөвчийн ууланд гарав. Энд өвөлжхөөс өөр замгүй. Түүнээс цааш яввал Алтайн өвөр говь руу орно. Тэнд орж хаваржина. Даваа өдөр бүхэн хонинд явж тэвэр өвс түүсээр орой ирнэ. Нэр байна, хор байна. Энэ хэдэн малыг бүрэн мэнд оруулж, төлийг нь бойжуулчих юм сан гэж хичээнэ. Тэгвэл болох нь тэр. Ам бардам очиж, хэдэн малыг нь тушаачихаад жолоочийн сургуульд явая гэж бодох болов.  ",
      result: [
        { correct: "Даваагийнх", incorrect: "Даваагынх" },
        { correct: "өвөлжихөөс", incorrect: "өвөлжхөөс" },
        { correct: "явбал", incorrect: "яввал" },
        { correct: "тушаачхаад", incorrect: "тушаачихаад" },
        { correct: "явъя", incorrect: "явая" },
      ],
    },
    {
      question:
        "Саяхан л шилбүүр унаад гүрвэл хөөж явсан балчир хүүхэд одоо үс сахал нь бууралтаж, нүд зовхи нь цэлхэрсэн хөгшин хар хүн болчихоод морины явдалд үүртэн сал сал шогшуулж явах юм хэмээн шоолж хөх инээд нь хүрэх байлгүй гэж бодхоос баахан ичих шиг болов.   “Дөшийн худаг дайрж морио услан, хүзүү толгойгоо угааж сэрүүцье. Ховоо татан нар шургаагүй худгын хүйтэн ус залгилая” гэдэг бодол гэнэт төрөв. ",
      result: [
        { correct: "болчхоод", incorrect: "болчихоод" },
        { correct: "бодохоос", incorrect: "бодхоос" },
        { correct: "дайрч", incorrect: "дайрж" },
        { correct: "худгийн", incorrect: "худгын" },
        { correct: "залгилъя", incorrect: "залгилая”" },
      ],
    },

    {
      question:
        "Тэр хар үүрээр сэрчихээд хийх юмаа олж ядхаараа морио эмээлэлж ойр хавийнхаа аль нэг толгод довцог дээр гараад орчин тойрныг ажиж, элдвийг дурсч суудаг зантай болжээ. Залуу зандан цагийнхтайгаа адил сайн морь унаад алсын аянд мордох чадалтай сан бол толгой хазайсан тийшээ арилж өгмөөр санагдавч эр бор харцагийн жигүүр цуцжээ.   ",

      result: [
        { correct: "сэрчхээд", incorrect: "сэрчихээд" },
        { correct: "ядахаараа", incorrect: "ядхаараа" },
        { correct: "эмээллэж", incorrect: "эмээлэлж" },
        { correct: "дурсаж", incorrect: "дурсч" },
        { correct: "харцагын", incorrect: "харцагийн" },
      ],
    },
    {
      question:
        "Шог хошин, инээдмийн жүжгийг тайзан дээрээс үзхийн хэрэггүй болж дээ. Зүгээр л гудамжнаас, дэлгэц, тайзнаас харж болно. Энэ цагын балай явдал буюу балайрлыг тоочсоноос балайгүй юм юу байна гэдгийг тоолвол дөхүү юм даа. Монголчуудын танхай мунхаг, тэнэг эрх чөлөө жинхэнэ балайрал руу хөтлөж байна. “Дураараа дургиж дунд чөмгөөрөө жиргэх”-ийг л хүний эрх чөлөө гээд ойлгочихож дээ.  ",
      result: [
        { correct: "үзэхийн", incorrect: "үзхийн" },
        { correct: "цагийн", incorrect: "цагын" },
        { correct: "тоолбол", incorrect: "тоолвол" },
        { correct: "хөтөлж", incorrect: "хөтлөж" },
        { correct: "ойлгочхож", incorrect: "ойлгочихож" },
      ],
    },
    {
      question:
        "Дэлхийн бөмбөрцөгийн нартай талыг өдөр, сартай талыг шөнө гэж нэрлэдэг.  Эрүүл мэндийн хичээлийн ач холбогдол их. Хүүхэд бүрийг багаас нь эрүүл мэндийн зөв дадал хэвшилд сургая. Миний дүү долоо хоногийн гурван өдөрт нь биеийн тамираар  хичээлэлдэг. Гарын ариун цэврийг сахъя. Дасгалжуулагчын мэргэшүүлэх сургалт маргааш эхлэнэ.  ",
      result: [
        { correct: "бөмбөрцгийн", incorrect: "бөмбөрцөгийн" },
        { correct: "сахья", incorrect: "сахъя" },
        { correct: "хичээллэдэг", incorrect: "хичээлэлдэг" },
        { correct: "Дасгалжуулагчийн", incorrect: "Дасгалжуулагчын" },
        { correct: "эхэлнэ", incorrect: "эхлэнэ" },
      ],
    },
    {
      question:
        "Дэвтрийг хүүхдийн сурлага, хүмүүжлийн толь гэдэг. Цэвэрхэн, нямбай бичсэн сурагчийн  дэвтэр эзнээ сурлага, хүмүүжлээр сайн гэдгийг батлана.   Иргэн бүр төрөлх эх нутаг,  хүрээлэн буй байгаль орчиноо унаган төрхөөр нь байлган хайрлаж хамгаалья. Өнөө хэрэглэж буй цагыг үүсэн бий болхын  өмнө хүмүүс амьдрал ахуйдаа элсэн цаг ашигладаг байжээ.",
      result: [
        { correct: "батална", incorrect: "батлана" },
        { correct: "орчноо", incorrect: "орчиноо" },
        { correct: "хамгаалъя", incorrect: "хамгаалья" },
        { correct: "болохын", incorrect: "болхын" },
        { correct: "цагийг", incorrect: "цагыг" },
      ],
    },
    {
      question:
        "... Энэ Дөшийн ус эгэл биш шүү. Жаахан уухлаар дуулмаар санагдаад байдаг юм. Орчлонгын ус уух заяа гэдэг энэ дээ. Ховоогоор биш, алтан аягаар л уумаар рашаан. Даанч чи бид хоёрт алтан аяга байхгүй гэснээ,  –Хоёулаа худгийн амитай хүйтэн ус ууж жаахан дуулая л даа гэж надаас гуйна. Цэвэгийн хуурай согтож дуулхыг сонсох сон гэхдээ би ховоотой ус дундаа тавьчихаад айраг ууж байгаа улс шиг хоёр талаас нь ээлжлэн залгилна.",
      result: [
        { correct: "Орчлонгийн", incorrect: "Орчлонгын" },
        { correct: "амьтай", incorrect: "амитай" },
        { correct: "дуулъя", incorrect: "дуулая" },
        { correct: "дуулахыг", incorrect: "дуулхыг" },
        { correct: "тавьчхаад", incorrect: "тавьчихаад" },
      ],
    },
    {
      question:
        "Юм бүхэнд хэмжээ дамжаа хэрэгтэй. Илүүдсэн бүхэн хор болдгын адил ааш хэтэрвэл амьдралд цөвтэй. Авиргүй ааштай нөхрөөс амжаж түргэн холд. Илүү дутуу ааш араншингүй хүнтэй эвэлж зохицох амархан. Шудрага үг чихэнд хатуу ч явдалд тустай болхоор анд нөхрийнхөө алдаа оноог алдалгүй хэлж тусал.",
      result: [
        { correct: "болдгийн", incorrect: "болдгын" },
        { correct: "амжиж", incorrect: "амжаж" },
        { correct: "эвлэж", incorrect: "эвэлж" },
        { correct: "Шударга", incorrect: "Шудрага" },
        { correct: "болохоор", incorrect: "болхоор" },
      ],
    },
    {
      question:
        "Хүн итгэсэн нөхөртөө л бэрхшээлээ тоочдог юм. Найз нөхөдийнхөө зовлон тоочхыг тэсвэртээгээр сонс. Тэгвэл түүний зовлон нимгэрч, сэтгэл нь уужирч байгааг царайны өнгө, дууны аялгаас нь чи аяндаа мэдэрнэ. Ингэснээр чи нөхрийнхөө давчуурсан сэтгэлийг тэлж өгнө. Найз нөхөдтэйгөө чин сэтгэлээсээ харицаж бай. Үнэнээрээ байх гоё. Худлаа инээснээс үнэнээсээ ууралсан нь хавьгүй дээр.   ",
      result: [
        { correct: "нөхдийнхөө", incorrect: "нөхөдийнхөө" },
        { correct: "тоочихыг", incorrect: "тоочхыг" },
        { correct: "тэсвэртэйгээр", incorrect: "тэсвэртээгээр" },
        { correct: "харьцаж", incorrect: "харицаж" },
        { correct: "уурласан", incorrect: "ууралсан" },
      ],
    },
    {
      question:
        "Төрийн далбаа соёмбо тэмдэгтэй бөгөөд гал шиг өөдлөж, нар сар шиг өдөр шөнөгүй мандан гийхийн санаа агуулсан гэдэг. Голын хоёр загас эр эмгүй энх жаргалын далайд умбаад өнийн хугцаанд өдөржин жаргахдаа загас мэт нүд цавчалгүй сонор сэрэмжтэй байхыг сургажээ. Олон хоногоор хурц нар шараж, хур чийг дутагдхад ган гачиг болно.  ",
      result: [
        { correct: "өөдөлж", incorrect: "өөдлөж" },
        { correct: "хугацаанд", incorrect: "хугцаанд" },
        { correct: "цавчилгүй", incorrect: "цавчалгүй" },
        { correct: "шарж", incorrect: "шараж" },
        { correct: "дутагдахад", incorrect: "дутагдхад" },
      ],
    },
    {
      question:
        "... Хар багадаа хурга хариулж яваад, ээжийн даллахыг харах мөн ч сайхан сан. Хурганаас ирэхэд сэнжтэй төмөр аяганд будаатай унд хийж, тависныг хүртэхэд ёстой гоё. Ээж уулга алдахдаа “Цөг”, өөрийгөө чамалсан үедээ “Буруу хойшоо” гэж хэлдэг. Анх сургуульд орсон намар “Гадаа дуу нь гарах шиг санагдаад хардаг байж билээ. Тэгэхэд шонгын хэцэн дээр бялзуухай жиргэж байдаг” гэж ээж минь хэлдэг сэн. Гэрийн хамаг ажилыг хийдэг болхоор сумын наадамд явах завдал ээжид олддоггүй байв... ",
      result: [
        { correct: "тавьсныг", incorrect: "тависныг" },
        { correct: "чамласан", incorrect: "чамалсан" },
        { correct: "шонгийн", incorrect: "шонгын" },
        { correct: "ажлыг", incorrect: "ажилыг" },
        { correct: "болохоор", incorrect: "болхоор" },
      ],
    },
    {
      question:
        "“Айлаас ирэхээр авдраа уудла” гэсэн монгол үг бий. Хүн бүрийн оюун ухааны авдарт “хүслийг хангагч чандмань эрдэнэ” дүүрэн байдаг юм. Гагцхүү авдарынхаа тагыг итгэлтэй сөхөж, хэрэгтэй зүйлээ оролдлого зүтгэлээр эрж хайж, эцэж цуцашгүй чармайлтаар олж илрүүлэн, оновчтой ашиглах л хэрэгтэй. Мөрөөдөл тэмүүлэл, өөдрөг сэтгэл, хичээл зүтгэл, тэсвэр тэвчээр, цөхрөлтгүй оролдлого, ажилсаг бүтээлч чадвар энэ бүгд бүтээлч хүнд зайлашгүй байх шилдэг чанарууд.  ",
      result: [
        { correct: "уудал", incorrect: "уудла”" },
        { correct: "авдрынхаа", incorrect: "авдарынхаа" },
        { correct: "зайлшгүй", incorrect: "зайлашгүй" },
        { correct: "эрэхээр", incorrect: "Дасгалирэхээржуулагчын" },
        { correct: "тагийг", incorrect: "тагыг" },
      ],
    },
    {
      question:
        "Анчид аа! Тахианы дэгдээхийгээ яасан бэ? Нөхөддөө байцай үзүүлье. Цахилгаан цахилахад цуурай давтана. Аргалийн сүрэг бэлчнэ. Цавьдар морио наадмаар уяя. Тэнгэр цэлмэсэн өдөр ургацаа хураахаар явлаа. Тэрхүү унасан дархи моддын үндсийг үерэлсэн горхи ууртайяа мөргөж, хөөс цахруулан шуугина. Үнээ тугаллаа. Хоёулаа явья.   ",
      result: [
        { correct: "Нөхдөдөө", incorrect: "Нөхөддөө" },
        { correct: "бэлчинэ", incorrect: "бэлчнэ" },
        { correct: "үерлэсэн", incorrect: "үерэлсэн" },
        { correct: "явъя", incorrect: "явья" },
        { correct: "тугаллалаа", incorrect: "тугаллаа" },
      ],
    },
    {
      question:
        "... Шавьдаа мамба дацангын хамбын олбогоо шилжүүлчихээд Ерлөгийн ууландаа гарч хөдөөлье байз. Дөчин жил хэнд ч ам  нээгээгүй хадгалсан “Алтан жүн жор”-ынхоо нууцыг шавьдаа тайлсан маань онолоо. Баргийн маарамба дийлхээргүй энэхүү ганц тангийнхаа жорыг улаан буйландаа зуусаар ертөнцөөс хальвал нүгэл шүү дээ.  Одоо энэ хүүгийн мөч богинодно уу гэхээс бурхнаас хайралсан ухаанаар бол маниас ч илүү.   ",
      result: [
        { correct: "дацангийн", incorrect: "дацангын" },
        { correct: "шилжүүлчхээд", incorrect: "шилжүүлчихээд" },
        { correct: "дийлэхээргүй", incorrect: "дийлхээргүй" },
        { correct: "халивал", incorrect: "хальвал" },
        { correct: "хайрласан", incorrect: "хайралсан" },
      ],
    },
    {
      question:
        "Хангайн сайхан нуруунаас гарсан Идрийн сайхан гол өндөр уулнаас буусан тул урсгал түргэн түргэн, бас л хөгжим шиг шуугьна. Хажууд нь суун чагнахад үнэхээр тааламжтай. Хүний өнгөрүүлэх зам ямар болхыг юунд урьдаас тайлбарлаж үл өгнө. Энэ тунгалаг ариун мөрөн хэчнээн мянган жил хэв хэвээр урссаар байтал, эрэг дагуу оршсон ёс гэтэл хүн амьтаны түүх байн байн хувилсаар ирэх нь тэмцээний үр байжээ. Орчин тойрон зэргэлсэн уулс бэрх өндөр, сэрвэн хад сэхийлцэн сахайлцан сүр жавхлан хэтэрхий, ой шугуй нягт зузаан, ус булаг хоржигнон хуржигнана.   ",
      result: [
        { correct: "шуугина", incorrect: "шуугьна" },
        { correct: "болохыг", incorrect: "болхыг" },
        { correct: "амьтны", incorrect: "амьтаны" },
        { correct: "зэрэглэсэн", incorrect: "зэргэлсэн" },
        { correct: "Идэрийн", incorrect: "Идрийн" },
      ],
    },
  ];
  const [asuult] = useState(asuultData);
  return (
    <AldaataiUgContext.Provider value={{ asuult }}>
      {children}
    </AldaataiUgContext.Provider>
  );
};
export default AldaataiUgProvider;
export const useAldaataiUgContext = () => useContext(AldaataiUgContext);
