import { createContext, useState, useContext } from "react";

const DataTailbarContext = createContext();

export function useDataTailbarContext() {
  return useContext(DataTailbarContext);
}

const DataTailbarProvider = ({ children }) => {
  const tailbarug = [
    { id: "1", word: "омруу", meaning: "морь малын өвчүү орчмын хэсэг" },
    {
      id: "2",
      word: "сэтэрлэх",
      meaning: "малыг бурхан сахиусанд өргөв хэмээн эдлэхгүй болгож дархлах",
    },
    { id: "3", word: "чивхрэх", meaning: "чангарах" },
    {
      id: "4",
      word: "жанч",
      meaning: "лам нарын өмсөх, хуниас гаргаж хийсэн хувцас",
    },
    { id: "5", word: "турсага", meaning: "турж үхсэн малын арьс" },
    { id: "6", word: "хиж", meaning: "сөөглөг ургамал" },
    { id: "7", word: "тулмайдах", meaning: "ямар нэг юмаар биеэ ороон нөмрөх" },
    { id: "8", word: "цүнхээл", meaning: "эргүүлэгтэй гүн ус" },
    { id: "9", word: "агсагадах", meaning: "хүний бие уналгад ядарч зүдрэх" },
    {
      id: "10",
      word: "хэдрэг",
      meaning:
        "арьс нэхий элдэхэд хэрэглэх, нэг талдаа хөрөөний шүд мэт иртэй урт нарийн хавтгай мод",
    },
    { id: "11", word: "байдас", meaning: "шүдлэн хязаалан насны гүү" },
    {
      id: "12",
      word: "үрээ",
      meaning: "шүдлэн, хязаалан, соёолон насны эр адуу",
    },
    { id: "13", word: "өеөдөх", meaning: "гишгэдэл алдан хэелэн унах" },
    {
      id: "14",
      word: "хуухирах",
      meaning:
        "адуу буга зэрэг амьтан юмнаас цочиж сэжиглэн хамраа хорд хийлгэн дуугарах",
    },
    {
      id: "15",
      word: "борви",
      meaning: "өсгийн дээд бүдүүн шөрмөс, тахилзуур",
    },
    {
      id: "16",
      word: "самсаа",
      meaning: "хоншоорын хоёр хажуугийн бяцхан хонхор",
    },
    {
      id: "17",
      word: "адасга",
      meaning: "туранхилан үхсэн үхэр адууны шир, тугал бярууны хатсан арьс",
    },
    {
      id: "18",
      word: "хөдөс",
      meaning: "элдсэн нэхий арьсны баахан хуучирсан хэсэг",
    },
    {
      id: "19",
      word: "үүрсэх",
      meaning: "адууны богино дуугаар янцгаах мэт хүхтнэн дуугарах",
    },
    {
      id: "20",
      word: "тангарах",
      meaning: "морь мал хойд хоёр хөлөөр зэрэг өшиглөх",
    },
    { id: "21", word: "мундаа", meaning: "адууны сэрвээний ар тал" },
    {
      id: "22",
      word: "хөхөл",
      meaning: "адууг дэллэхдээ толгой дээр нь үлдээсэн урт туг үс",
    },
    { id: "23", word: "гиваан", meaning: "Шар өнгөтэй шороо, чулуу" },
    {
      id: "24",
      word: "хяруу",
      meaning: "Газарт унасан шүүдрийн хүйтэнд царцсан цан",
    },
    {
      id: "25",
      word: "олбог",
      meaning: "Эсгий, цэмбэ, торго зэргээр өнгөлж хийсэн дөрвөлжин дэвсгэр",
    },
    {
      id: "26",
      word: "хамба",
      meaning: "Шашны сүм хийдийг тэргүүлэн удирдах хүний тушаалын нэр",
    },
    {
      id: "27",
      word: "маарамба",
      meaning: "Энэтхэг Түвдийн эмийн 4 үндсийг судалсан, эмч лам /оточ/",
    },
    { id: "28", word: "Эмнэг", meaning: "орь уургалахад сургасан морь" },
    { id: "29", word: "Саахалт", meaning: "Ойрхон буусан хоёр айл" },
    {
      id: "30",
      word: "Тойром",
      meaning: "Нуур байгаад хатаж ширгэсэн шаварлаг хөрстэй газар",
    },
    {
      id: "31",
      word: "Уургын хээр",
      meaning: "Догшин, атар, уналгаа эдэлгээнд сургаагүй адгуус",
    },
    { id: "32", word: "Унаагаа юүлэх", meaning: "Морио солих" },
    { id: "33", word: "суурин", meaning: "суурьшил бүхий томоохон газар" },
    {
      id: "34",
      word: "хайлаас",
      meaning: "уян бөгөөд бөх чанартай навчит мод",
    },
    { id: "35", word: "манхан", meaning: "хайрхаг, элс ихтэй гүвээ газар" },
    { id: "36", word: "гох", meaning: "бууны замаг буулгах дэгээ" },
    { id: "37", word: "санчиг", meaning: "хоёр чамархай болон шанааны үс" },
    { id: "38", word: "аниртах", meaning: "сонсогдох, дуулдах" },
    { id: "39", word: "хэлтрүүлэх", meaning: "өршөөх уучлах" },
    { id: "40", word: "халих", meaning: "үхэх, нөгчих" },
    { id: "41", word: "орчих", meaning: "эргэх, өнгөрөх" },
    { id: "42", word: "хөөрөгдөх", meaning: "Үлээлгэх, дэвэргэх" },
    { id: "43", word: "омогших", meaning: "бардам дээрэнгүй болох" },
    { id: "44", word: "элдэвлэх", meaning: "зүйл бүрийн арга сэдэх" },
    { id: "45", word: "баадагнах", meaning: "вааданд боох ороох" },
    {
      id: "46",
      word: "цоргиулах",
      meaning: "юмны халуун илч, уур юманд хүрч халаах",
    },
    { id: "47", word: "хиаруулах", meaning: "үлэмж ихээр сүйрүүлэх, үхүүлэх" },
    {
      id: "48",
      word: "мэнгэр",
      meaning: "уушгины цагаан гуурснуудын салст бүрхэвч үрэвсэж өвчлөх өвчин",
    },
    { id: "49", word: "яндан", meaning: "авлын ясны магнайн төв хэсэг" },
    {
      id: "50",
      word: "бохь",
      meaning: "гаансны дотор тогтох муухай үнэртэй хар юм",
    },
    { id: "51", word: "цох", meaning: "гавлын ясны магнайн төв хэсэг" },
    {
      id: "52",
      word: "сор",
      meaning: "мал, амьтны ноолууртай хольцолдон ургасан урт ширүүн үс",
    },
  ];

  const [tailbardata, setTailbardata] = useState(tailbarug);

  return (
    <DataTailbarContext.Provider value={{ tailbardata }}>
      {children}
    </DataTailbarContext.Provider>
  );
};
export default DataTailbarProvider;
